---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlantedColumnFailures.SlantedColumnCannotCutEndWarn
source: html/a4d35b4c-e02d-86da-d995-84df55a5dc08.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlantedColumnFailures.SlantedColumnCannotCutEndWarn Property

Unable to trim slanted column end geometry to desired condition.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlantedColumnCannotCutEndWarn { get; }
```